[{"data":1,"prerenderedAt":101},["Reactive",2],{"search-api":3},[4,11,23,34,43,55,64,83,94],{"id":5,"path":6,"dir":7,"title":8,"description":7,"keywords":9,"body":10},"content:0.index.md","/","","Home",[],"     Livello Applicativo dell'ISO/OSI.   Questa relazione ti spiegerà i seguenti concetti del livello applicativo:     I Protocolli principali ed il loro funzionamento  Il modello   client  /   server  I Protocolli   FTP ,   Email ,   DNS ,   HTTP  in dettaglio",{"id":12,"path":13,"dir":14,"title":15,"description":16,"keywords":17,"body":22},"content:1.iso-osi:1.introduzione.md","/iso-osi/introduzione","iso-osi","Introduzione","Il livello applicativo nell'architettura OSI (Open Systems Interconnection) è il settimo e ultimo livello. L'architettura OSI è un modello di riferimento che definisce sette livelli o strati che descrivono le funzioni di comunicazione di un sistema di rete. Il livello applicativo è il più alto di questi sette livelli.",[18,19,20,21],"Esempi di protocolli applicativi","Socket","Porte dei protocolli applicativi più comuni","Architetture delle applicazioni di rete","  Introduzione  Il livello applicativo nell'architettura OSI (Open Systems Interconnection) è il settimo e ultimo livello. L'architettura OSI è un modello di riferimento che definisce sette livelli o strati che descrivono le funzioni di comunicazione di un sistema di rete. Il livello applicativo è il più alto di questi sette livelli.  Il livello applicativo fornisce l'interfaccia tra il software di rete e le applicazioni utente finali. Questo livello gestisce le comunicazioni di alto livello tra le applicazioni, fornendo servizi di rete come il trasferimento di file, la gestione delle sessioni, l'accesso remoto e altri servizi di comunicazione avanzati. Inoltre, il livello applicativo fornisce servizi di rete che possono essere utilizzati da programmi applicativi.  Il livello applicativo svolge un ruolo fondamentale nella facilitazione della comunicazione tra le applicazioni e nel fornire servizi di rete avanzati. La sua posizione più elevata nell'architettura OSI lo rende responsabile della comprensione del contenuto dei dati e della gestione delle interazioni tra le applicazioni utente finali.    Esempi di protocolli applicativi  Alcuni dei protocolli comuni associati al livello applicativo includono:   HTTP (Hypertext Transfer Protocol) : Utilizzato per la trasmissione di dati ipertestuali su Internet, comunemente associato alla navigazione web.   FTP (File Transfer Protocol) : Utilizzato per il trasferimento di file tra sistemi su una rete.   SMTP (Simple Mail Transfer Protocol) : Utilizzato per la trasmissione di email attraverso le reti.   DNS (Domain Name System) : Utilizzato per la risoluzione dei nomi di dominio in indirizzi IP.   SNMP (Simple Network Management Protocol) : Utilizzato per il monitoraggio e la gestione delle reti.   POP3 (Post Office Protocol versione 3) : Utilizzato per il recupero delle email da un server di posta elettronica.   SSH (Secure Shell) : Utilizzato per l'accesso remoto sicuro ai server.   Telnet : Utilizzato per l'accesso remoto a un sistema di computer.  Socket  Un socket è un punto di terminazione in una rete che consente la comunicazione tra programmi su diversi computer. Si identifica tramite un indirizzo IP e un numero di porta e facilita lo scambio di dati tra i programmi, spesso utilizzato nelle comunicazioni client-server su reti come Internet.    Porte dei protocolli applicativi più comuni     Protocollo  Porta    FTP (File Transfer Protocol) data  20   FTP (File Transfer Protocol) control  21   Telnet  23   SSH (Secure Shell)  22   SMTP (Simple Mail Transfer Protocol)  25   DNS (Domain Name System)  53   HTTP (Hypertext Transfer Protocol)  80   POP3 (Post Office Protocol versione 3)  110   IMAP (Internet Message Access Protocol)  143   SNMP (Simple Network Management Protocol)  161   HTTPS (HTTP Secure)  443   FTPS (FTP Secure) data  989   FTPS (FTP Secure) control  990  Architetture delle applicazioni di rete  Le architetture delle applicazioni di rete definiscono il modo in cui i componenti di un'applicazione interagiscono e si distribuiscono sulla rete. Ecco una breve descrizione del ruolo di ciascuna architettura:  Client-Server:    Descrizione : In un'architettura client-server, un server fornisce servizi o risorse a client che ne fanno richiesta. I client sono dispositivi o applicazioni che inviano richieste al server per ottenere dati, elaborazione o altri servizi.   Utilizzo : Comunemente utilizzato per applicazioni centralizzate come siti web, database e servizi di posta elettronica. Il server gestisce le risorse, e i client ne fanno richiesta.   Esempio : Un sito web di notizie. Nel modello client-server, il server ospita il sito web e gestisce il contenuto. I client (i browser web degli utenti) fanno richieste al server per visualizzare pagine specifiche o recuperare informazioni. Il server elabora le richieste e invia indietro i dati richiesti ai client.    Peer-to-Peer (P2P):    Descrizione : In un'architettura peer-to-peer, i dispositivi nella rete sono considerati \"peer\" e possono agire sia come client che come server. La comunicazione può avviene direttamente tra i peer senza un server centrale, oppure con un server che fa da intermedio, ma non viene utilizzato per memorizzare i dati, ma solo per visualizzare i peer dispoinbili.   Utilizzo : Comunemente utilizzato per condivisione di file, comunicazione peer-to-peer e reti decentralizzate. Ogni peer contribuisce alle risorse e alla capacità di elaborazione.   Esempio Decentralizzato : Un'applicazione di condivisione di file P2P come BitTorrent. In un'applicazione BitTorrent, i partecipanti (peer) scaricano e caricano parti di un file direttamente tra di loro, senza un server centrale che gestisce il processo. Ogni peer contribuisce alle risorse di archiviazione e alla velocità di trasferimento dei dati.   Esempio centralizzato  Napster: utenti si connettono a un server dove pubblicano i nomi delle\nrisorse che condividono\n   Ibride (Client-Server e P2P):    Descrizione :\nL'architettura ibrida combina caratteristiche delle architetture client-server e peer-to-peer. Nel modello P2P ibrido, alcuni nodi svolgono ruoli client-server, mentre altri sono designati dinamicamente come super-nodi tramite un algoritmo di elezione. Questi super-nodi non solo partecipano alle funzioni peer-to-peer, ma agiscono anche come indicizzatori, mentre gli altri nodi, chiamati leaf peer, partecipano alle interazioni peer-to-peer senza svolgere la funzione di indicizzazione. Questa struttura ibrida offre una flessibilità maggiore, combinando decentralizzazione e organizzazione gerarchica.   Utilizzo : Offre flessibilità e tolleranza ai guasti. Parti del sistema possono essere gestite centralmente (client-server), mentre altre possono essere distribuite in modo più decentralizzato (P2P).   Esempio : Un sistema di gioco online. Nel contesto di un gioco online, alcuni elementi del gioco possono essere gestiti centralmente su server (ad esempio, database di account e regole di gioco), mentre la comunicazione in tempo reale tra giocatori può avvenire direttamente tra i loro dispositivi (peer-to-peer) per ridurre la latenza e migliorare l'esperienza di gioco.  ",{"id":24,"path":25,"dir":26,"title":27,"description":28,"keywords":29,"body":33},"content:2.web-http-ftp:1.client-server.md","/web-http-ftp/client-server","web-http-ftp","Modello Client/Server","Il modello client-server è un'architettura di rete in cui i ruoli e le responsabilità sono distribuiti tra due tipi principali di entità: il client e il server.",[30,31,32],"Client","Server","Esempio di Interazione Client-server","  Modello Client/Server  Il modello client-server è un'architettura di rete in cui i ruoli e le responsabilità sono distribuiti tra due tipi principali di entità: il client e il server.   Modello Client/Server nel Contesto del Web:  Client    Descrizione:  Il client è un'applicazione o un dispositivo che richiede servizi o risorse da un server. In genere, il client è l'utente finale o un'applicazione interattiva che avvia richieste al server.   Ruolo:  Il client inizia le richieste al server, aspetta le risposte e gestisce l'interfaccia utente.   Elemento Attivo nel Web:  I client, come i web browser, sono elementi attivi che utilizzano il protocollo HTTP per connettersi ai server secondo un modello a client attivo. Usano URL per identificare risorse e richiedono pagine web ai server, visualizzandone il contenuto.  Server    Descrizione:  Il server è un'applicazione o un dispositivo che fornisce servizi o risorse ai client. Risponde alle richieste dei client, elabora le informazioni e invia i risultati al client.   Ruolo:  Il server gestisce risorse, dati e svolge operazioni specifiche richieste dai client.   Elemento Passivo nel Web:  I server, come i web server o HTTP server, sono elementi passivi che rimangono in ascolto di eventuali connessioni da parte dei client su una determinata   porta TCP , secondo un modello a server passivo. Utilizzano il protocollo HTTP per interagire con i client, fornendo loro le pagine web o le risorse richieste.  Esempio di Interazione Client-server      Inizializzazione:   Un utente (client) apre il browser e digita l'URL di un sito di e-commerce (ad esempio,   www.amazon.it ).  Il browser invia una richiesta HTTP al server del sito di e-commerce.   Richiesta del Cliente:   Il server (che ospita il sito web di e-commerce) riceve la richiesta dal browser del cliente.  Il server interpreta la richiesta e recupera i dati necessari dal database.   Elaborazione Server:   Il server esegue le operazioni necessarie per soddisfare la richiesta del cliente. Ad esempio, potrebbe recuperare informazioni sul prodotto, prezzi, immagini, ecc.   Risposta del Server:   Il server crea una risposta contenente i dati richiesti e la invia al browser del cliente tramite una risposta HTTP.  La risposta può includere codice HTML, CSS, JavaScript e risorse come immagini che vengono gestite dal MIME.   Il   MIME  (Multipurpose Internet Mail Extensions) è uno standard che specifica i tipi di dati e i formati dei file su Internet. La principale funzione di MIME è consentire ai sistemi di trasferire file non solo come dati binari, ma anche come dati di testo in formato ASCII. In altre parole, MIME estende il protocollo di trasmissione di posta elettronica per supportare tipi di dati multipli, non solo testo.    Rendering del Browser:   Il browser del cliente riceve la risposta dal server e inizia a renderizzare la pagina web utilizzando i dati e le risorse fornite.  L'utente visualizza la pagina del sito di e-commerce sul suo browser.   Interazione Utente:   L'utente interagisce con la pagina web, ad esempio, navigando tra le categorie di prodotti o aggiungendo articoli al carrello.  Ogni interazione genera nuove richieste che vengono inviate al server.   Nuove Richieste e Risposte:   Ogni nuova azione dell'utente (clic, scorrimento, aggiunta al carrello) genera richieste al server.  Il server elabora ciascuna richiesta, aggiorna lo stato e invia le risposte corrispondenti per aggiornare dinamicamente la pagina web nel browser del cliente, per fare ciò si utilizza AJAX.    AJAX , acronimo di \"Asynchronous JavaScript and XML,\" è una tecnologia di sviluppo web che consente di creare applicazioni interattive e dinamiche, aggiornando i contenuti di una pagina web senza dover ricaricare completamente la pagina stessa. La chiave di AJAX è la sua capacità di effettuare richieste asincrone al server web, consentendo agli utenti di interagire con la pagina senza interruzioni.  In questo modo, l'interazione tra client e server avviene continuamente mentre l'utente naviga e interagisce con il sito di e-commerce. Il modello client-server consente una distribuzione efficiente delle responsabilità, con il server che gestisce i dati e il client che gestisce l'interfaccia utente.",{"id":35,"path":36,"dir":26,"title":37,"description":7,"keywords":38,"body":42},"content:2.web-http-ftp:2.accesso-alle-risorse.md","/web-http-ftp/accesso-alle-risorse","Identificazione delle Risorse",[39,40,41],"URI (Uniform Resource Identifier)","URL (Uniform Resource Locator)","URN (Uniform Resource Name)","  Identificazione delle Risorse  URI (Uniform Resource Identifier)  Il   URI (Uniform Resource Identifier)  è un set generico di nomi o indirizzi che rappresentano stringhe assegnate alle risorse. Gli URI sono costituiti dall'unione di URL (Uniform Resource Locator) e URN (Uniform Resource Name), dove URN è un sottoinsieme di URI che rimane persistente anche quando la risorsa non è più disponibile.    Un indirizzo URI è formato da due elementi separati dai due punti (:): lo   schema  e la   parte specifica . I componenti di un URI sono i seguenti:     COMPONENTE  SIGNIFICATO    Protocollo  Identifica il protocollo dello strato dell'applicazione (http, https, ftp, mailto, file, ecc.) di cui si ha bisogno per accedere alla risorsa.   Username  Se il protocollo supporta il concetto di username, questo componente fornisce uno che ha accesso alla risorsa.   Password  La password associata allo username.   Host  Il sistema di comunicazione che ha la risorsa; per HTTP questo è il server web.   Porta  La porta TCP che i protocolli dello strato dell'applicazione dovrebbero usare per accedere alla risorsa; per HTTP è in genere 80.   Percorso  Il percorso attraverso un'organizzazione gerarchica tramite la quale la risorsa è localizzata, spesso una struttura di directory del file system o qualcosa di equivalente.   File  La risorsa stessa.   Query  Informazione addizionale sulla risorsa o sul client.   Frammento  Una particolare ubicazione all'interno di una risorsa.  In sintesi, un URI fornisce un modo standardizzato di identificare e accedere a risorse su Internet, e i suoi componenti specificano vari dettagli sulla posizione e la natura della risorsa.  Ecco un esempio completo di URI con tutti i componenti:     https://utente:password@www.example.com:8080/percorso/file.html?query=parametro#frammento\n   Schema: \"https\"  Username: \"utente\"  Password: \"password\"  Host: \"  www.example.com \"  Porta: 8080  Percorso: \"/percorso/\"  File: \"file.html\"  Query: \"?query=parametro\"  Frammento: \"#frammento\"  URL (Uniform Resource Locator)  Un tipo di URI che fornisce il mezzo per recuperare la risorsa identificata. Gli URL specificano la posizione di una risorsa su Internet e il protocollo da utilizzare per accedervi. Esempio: \"  https://www.example.com/pagina.html \".    URN (Uniform Resource Name)  Un tipo di URI che fornisce un nome persistente per una risorsa senza specificare la posizione o il mezzo di accesso. Gli URN sono progettati per rimanere validi nel tempo, anche se la risorsa viene spostata o cambiata. Esempio: \"urn:isbn:0451450523\" identifica un libro tramite il suo numero ISBN.  html .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}html.dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}html .dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}html .default .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}",{"id":44,"path":45,"dir":26,"title":46,"description":47,"keywords":48,"body":54},"content:2.web-http-ftp:3.http.md","/web-http-ftp/http","HTTP","HTTP (Hypertext Transfer Protocol) è uno dei protocolli fondamentali su cui si basa il World Wide Web. Ha un'architettura client-server, in cui il client (solitamente un browser) fa richieste al server, che risponde fornendo i dati richiesti. Oltre a HTTP, è importante notare che esistono varianti sicure del protocollo, come HTTPS (HTTP Secure), che aggiunge uno strato di crittografia attraverso TLS (Transport Layer Security) per garantire la sicurezza delle comunicazioni.",[49,50,51,52,53],"Differenze tra HTTP 1.0, 1.1, 2.0","Metodi HTTP","Formato di una richiesta HTTP","Esempio di Conversazione HTTP tra Client e Server:","Codici di stato HTTP","  HTTP  HTTP (Hypertext Transfer Protocol) è uno dei protocolli fondamentali su cui si basa il World Wide Web. Ha un'architettura client-server, in cui il client (solitamente un browser) fa richieste al server, che risponde fornendo i dati richiesti. Oltre a HTTP, è importante notare che esistono varianti sicure del protocollo, come HTTPS (HTTP Secure), che aggiunge uno strato di crittografia attraverso TLS (Transport Layer Security) per garantire la sicurezza delle comunicazioni.    Differenze tra HTTP 1.0, 1.1, 2.0    HTTP/1.0:    Connessione:  Richiede una connessione separata per ogni risorsa.   Pipelining:  Non supportato di default; alcuni browser potevano implementarlo in modo non standard.   Multiplexing:  Non supportato.   HTTP/1.1:    Connessione:  Persistente per default, consentendo più richieste e risposte su una singola connessione.   Pipelining:  Supportato, ma con limitazioni di implementazione.   Multiplexing:  Non supportato, richiedendo più connessioni per parallelizzare il recupero di risorse.   HTTP/2.0:    Connessione:  Persistente, con supporto per la multiplexing delle richieste e delle risposte su una singola connessione.   Pipelining:  Obsoleto, sostituito dal multiplexing.   Multiplexing:  Supportato, migliorando l'efficienza e le prestazioni.   Pipelining:   È un concetto indipendente dalla versione di HTTP.  Consente al client di inviare più richieste senza attendere la risposta per ogni richiesta.  Può causare problemi di \"head-of-line blocking\" e non è ampiamente adottato.    In sintesi, HTTP/1.1 ha introdotto la persistenza della connessione e il supporto pipelining, ma con limitazioni. HTTP/2.0 ha migliorato ulteriormente le prestazioni attraverso il multiplexing, rendendo obsoleto l'utilizzo di pipelining. La scelta tra HTTP/1.1 e HTTP/2.0 dipende dalle esigenze specifiche del progetto e dalle considerazioni di compatibilità.  Metodi HTTP      GET:   Utilizzato per recuperare dati da una risorsa specificata.  Non dovrebbe avere effetti collaterali sullo stato del server o delle risorse.   POST:   Utilizzato per inviare dati al server per essere elaborati.  Può essere utilizzato per creare una nuova risorsa quando la risorsa specificata nell'URL non esiste.   PUT:   Utilizzato per aggiornare o creare una risorsa alla posizione specificata nell'URL.  Deve essere idempotente, il che significa che l'applicazione dello stesso metodo più volte produce lo stesso risultato.   DELETE:   Utilizzato per richiedere la rimozione di una risorsa specificata.  Deve essere idempotente.   PATCH:   Utilizzato per applicare modifiche parziali a una risorsa.  Specifica quali modifiche devono essere applicate.   HEAD:   Simile a GET, ma richiede solo le informazioni sull'intestazione della risposta, senza il corpo della risorsa.  Utilizzato per ottenere informazioni sull'intestazione senza dover trasferire l'intera risorsa.   OPTIONS:   Utilizzato per descrivere le opzioni di comunicazione per la risorsa di destinazione.  Consente al client di determinare le opzioni e/o i requisiti associati a una risorsa senza effettuare una richiesta completa.   TRACE:   Utilizzato per eseguire un test di loopback lungo il percorso verso la risorsa di destinazione.  Utile per il debug e la diagnostica.   CONNECT:   Riservato per l'uso con un server proxy che può essere utilizzato per stabilire una connessione di rete sicura con una risorsa.  Formato di una richiesta HTTP  Una richiesta HTTP è composta da due parti principali: l'intestazione (header) e il corpo (body).    Intestazione (Header) HTTP:  L'intestazione contiene informazioni aggiuntive sulla richiesta e solitamente è divisa in diversi campi. Ogni campo dell'intestazione ha un nome e un valore separati da due punti. Gli header comuni includono:    Host:  Specifica il nome del server a cui è destinata la richiesta.   User-Agent:  Identifica il software del client che fa la richiesta.   Content-Type:  Indica il tipo di dati presenti nel corpo della richiesta (applicabile solo se il corpo è presente).   Authorization:  Contiene le credenziali dell'utente per l'autenticazione.   Accept:  Specifica i tipi di media che il client può ricevere dalla risposta.   Cookie:  Invia dati memorizzati nel cookie dal client al server.  Esempio di intestazione HTTP:   GET /path/to/resource HTTP/1.1\nHost: www.example.com\nUser-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:100.0) Gecko/20100101 Firefox/100.0\nAccept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8\n  Corpo (Body) HTTP:  Il corpo contiene dati aggiuntivi associati alla richiesta, come parametri del modulo HTML inviati tramite una richiesta POST. Non tutte le richieste HTTP hanno un corpo. La presenza e la struttura del corpo dipendono dal tipo di richiesta e dal suo scopo.  Esempio di richiesta POST con corpo:   POST /submit-form HTTP/1.1\nHost: www.example.com\nContent-Type: application/x-www-form-urlencoded\n\nusername=johndoe&password=securepassword\n  In questo caso, il corpo della richiesta contiene dati di formattazione di tipo application/x-www-form-urlencoded, che sono chiavi e valori separati da \"&\".  Esempio di Conversazione HTTP tra Client e Server:  1. Richiesta (Client to Server):    Client : (invia una richiesta GET per ottenere la pagina principale)   GET /index.html HTTP/1.1\nHost: www.example.com\nConnection: keep-alive\n  2. Risposta (Server to Client):    Server : (risponde con uno stato 200 OK e invia la pagina HTML)     HTTP/1.1 200 OK\n   Content-Type: text/html\n   \n   \u003C!  DOCTYPE   html  >\n   \u003C  html  >\n   \u003C  head  >\n       \u003C  title  >Pagina Principale\u003C/  title  >\n   \u003C/  head  >\n   \u003C  body  >\n       \u003C  h1  >Benvenuto su www.example.com!\u003C/  h1  >\n   \u003C/  body  >\n   \u003C/  html  >\n  3. Nuova Richiesta (Client to Server):    Client : (chiede un file CSS aggiuntivo)   GET /style.css HTTP/1.1\nHost: www.example.com\nConnection: keep-alive\n  4. Nuova Risposta (Server to Client):    Server : (risponde con il contenuto del file CSS)     HTTP/1  .1   200 OK\n   Content-Type: text/css\n   \n   body   {\n       background-color  :   #f0f0f0  ;\n       font-family  :   Arial  ,   sans-serif  ;\n   }\n   \n   h1   {\n       color  :   #333333  ;\n   }\n  Codici di stato HTTP      1xx (Informazionale):    100 Continue:  Il server ha ricevuto la richiesta iniziale ed è pronto a ricevere il resto.   2xx (Successo):    200 OK:  La richiesta è stata completata con successo.   201 Created:  La richiesta è stata completata con successo e una nuova risorsa è stata creata come risultato.   204 No Content:  La richiesta è stata completata con successo, ma non c'è alcun contenuto da restituire.   3xx (Redirezione):    301 Moved Permanently:  La risorsa è stata spostata permanentemente a un nuovo URI.   302 Found:  La risorsa è stata temporaneamente spostata a un nuovo URI.   304 Not Modified:  La risorsa non è stata modificata dalla sua ultima richiesta.   4xx (Errore del cliente):    400 Bad Request:  La richiesta del cliente è stata impropria o non può essere elaborata dal server.   401 Unauthorized:  Il cliente deve autenticarsi per ottenere la risorsa richiesta.   403 Forbidden:  Il cliente non ha il permesso di accedere alla risorsa richiesta.   404 Not Found:  La risorsa richiesta non è stata trovata sul server.   5xx (Errore del server):    500 Internal Server Error:  Il server ha riscontrato un errore interno e non può completare la richiesta.   502 Bad Gateway:  Il server agisce come gateway o proxy e ha ricevuto una risposta non valida dal server upstream.   503 Service Unavailable:  Il server non è pronto a gestire la richiesta. Comunemente dovuto a sovraccarico o manutenzione.  html .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}html.dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}html .dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}html .default .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}",{"id":56,"path":57,"dir":26,"title":58,"description":59,"keywords":60,"body":63},"content:2.web-http-ftp:4.ftp.md","/web-http-ftp/ftp","FTP","FTP (File Transfer Protocol) è un protocollo di rete utilizzato per il trasferimento di file tra un client e un server su una rete TCP/IP (Transmission Control Protocol/Internet Protocol). FTP consente agli utenti di copiare file da un computer a un server o da un server a un computer tramite una connessione dati.",[61,62],"Connesioni FTP","Esempio","  FTP  FTP (File Transfer Protocol) è un protocollo di rete utilizzato per il trasferimento di file tra un client e un server su una rete TCP/IP (Transmission Control Protocol/Internet Protocol). FTP consente agli utenti di copiare file da un computer a un server o da un server a un computer tramite una connessione dati.  Esempio di utilizzo di FTP da un terminale:     ftp   nome_host_o_indirizzo_ip\n  Dove   nome_host_o_indirizzo_ip  è il nome di dominio o l'indirizzo IP del server FTP a cui ci si desidera connettere.  Una volta stabilita la connessione FTP, è possibile eseguire comandi come:    put : Carica un file dal client al server.   get o mget : Scarica un file dal server al client.   ls o dir : Elenca i file nella directory corrente del server.   cd : Cambia la directory corrente sul server.  FTP è stato uno dei primi protocolli utilizzati per il trasferimento di file su Internet, ma a causa delle sue vulnerabilità alla sicurezza (come il trasferimento di dati non crittografati), è consigliabile utilizzare protocolli più sicuri come FTPS (FTP sicuro) o SFTP (SSH File Transfer Protocol) per garantire la protezione dei dati durante il trasferimento.  Connesioni FTP  In un'implementazione tipica di FTP, ci sono due connessioni distinte:    Control Connection (Porta 21):   Questa connessione è utilizzata per inviare comandi e informazioni di controllo tra il client e il server FTP.  Tutti i comandi FTP, come l'autenticazione, il cambio directory, la lista dei file, ecc., vengono scambiati attraverso questa connessione.  In genere, il server ascolta sulla porta 21 e il client si connette a questa porta.   Data Connection (Porta 20):   La connessione dati viene utilizzata per il trasferimento effettivo dei file tra il client e il server FTP.  La modalità di trasferimento può essere attiva o passiva, e la porta per la connessione dati viene negoziata durante l'esecuzione di certi comandi (ad esempio,   PORT  per la modalità attiva, o   PASV  per la modalità passiva).  Nella modalità attiva, il client apre una porta casuale e informa il server su quale porta sta ascoltando. Il server quindi connette la sua porta dati alla porta del client per trasferire i dati.  Nella modalità passiva, il server apre una porta casuale e informa il client su quale porta sta ascoltando. Il client quindi si connette alla porta del server per trasferire i dati.  Esempio  Ecco un esempio di utilizzo di un client FTP da linea di comando su un sistema Unix-like (Linux o macOS). In questo esempio, useremo il comando ftp per connetterci a un server FTP e trasferire un file oppure si potrebbe utilizzare FileZilla.     # Apri il terminale\n   \n   # Avvia il client FTP e connettiti al server FTP (sostituisci \"ftp.example.com\" con il tuo server FTP)\n   ftp   ftp.example.com\n   \n   # Inserisci il nome utente e la password quando richiesto\n   Username:   tuo_nome_utente\n   Password:   tua_password\n   \n   # Una volta connesso, puoi eseguire comandi FTP come ad esempio:\n   # - put: Carica un file dal client al server\n   # - get: Scarica un file dal server al client\n   # - ls: Elenca i file nella directory corrente del server\n   # - cd: Cambia la directory corrente sul server\n   \n   # Esempio: Carica un file dal client al server\n   put   file_locale.txt\n   \n   # Esempio: Scarica un file dal server al client\n   get   file_remoto.txt\n   \n   # Esempio: Elenca i file nella directory corrente del server\n   ls\n   \n   # Esempio: Cambia la directory corrente sul server\n   cd   directory_remota\n   \n   # Termina la sessione FTP\n   bye\n  html .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}html.dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}html .dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}html .default .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}",{"id":65,"path":66,"dir":7,"title":67,"description":68,"keywords":69,"body":82},"content:3.email-dns-telnet:1.index.md","/email-dns-telnet","Email","Il servizio email, abbreviazione di \"electronic mail\" o posta elettronica, è un sistema che consente agli utenti di inviare e ricevere messaggi digitali attraverso Internet. La posta elettronica è diventata uno dei mezzi di comunicazione più diffusi e utilizzati, sia a livello personale che professionale. Ecco come funziona generalmente un servizio email:",[70,71,72,73,74,75,76,77,78,79,80,81],"Struttura di un Indirizzo Email:","Spam","POP Mail (Post Office Protocol):","Web Mail","Web mail vs Post mail","Protocolli per l'invio:","Protocolli per la ricezione:","MTA (Mail Transfer Agent)","MUA (Mail User Agent):","SMTP (Simple Mail Transfer Protocol)","Post Office Protocol (POP3)","IMAP (Internet Mail Access Protocol)","  Email  Il servizio email, abbreviazione di \"electronic mail\" o posta elettronica, è un sistema che consente agli utenti di inviare e ricevere messaggi digitali attraverso Internet. La posta elettronica è diventata uno dei mezzi di comunicazione più diffusi e utilizzati, sia a livello personale che professionale. Ecco come funziona generalmente un servizio email:  Struttura di un Indirizzo Email:  Un indirizzo email ha generalmente la seguente    struttura : utente@dominio.  L'  utente  è il nome specifico dell'account di posta elettronica associato all'utente.  Il   dominio  rappresenta il server di posta elettronica che gestisce l'account.  Spam  Lo spam si riferisce a messaggi indesiderati, tipicamente inviati via email, che promuovono prodotti, servizi o contenuti. Questi messaggi sono spesso inviati in modo massiccio e possono violare normative sulla privacy, causando disturbo agli utenti.  POP Mail (Post Office Protocol):  è un protocollo utilizzato per recuperare le email da un server di posta elettronica al proprio dispositivo locale. Quando si utilizza POP, le email vengono scaricate dal server sul dispositivo dell'utente e vengono solitamente rimosse dal server, rendendo la gestione delle email principalmente locale. POP è particolarmente adatto per chi preferisce archiviare e gestire le email direttamente sul proprio computer.  Web Mail  La Web Mail, o posta elettronica basata sul web, consente di accedere alle email attraverso un browser web. In questo caso, le email sono memorizzate sul server di posta elettronica, consentendo l'accesso da qualsiasi dispositivo con una connessione Internet. Popolari servizi di web mail includono Gmail, Outlook, e Yahoo Mail. La gestione delle email avviene attraverso un'interfaccia web, offrendo maggiore flessibilità e accessibilità rispetto a un sistema basato su POP, ma richiede una connessione Internet per visualizzare e gestire le email.    Web mail vs Post mail     WEB MAIL  POP MAIL    Gratuita  Spesso a pagamento   Accesso da qualunque computer con connessione a Internet  Accesso solo da computer nel quale è installato il programma di posta elettronica (client)   Necessità di ricordare la password a ogni accesso  Password memorizzata solo durante la creazione dell’account   Metodo poco sicuro, le password possono essere intercettate  Metodo sicuro in quanto le password sono memorizzate nel computer client   Gli allegati sono consentiti solo se sono di dimensioni limitate  Gli allegati possono essere di dimensioni molto elevate   Rischio di ricevere molte email indesiderate (spam)  Rischio spam ridotto  Protocolli per l'invio:   SMTP (Simple Mail Transfer Protocol) :\nProtocollo standard per l'invio di email. SMTP è utilizzato dai client di posta elettronica per inviare messaggi a un server di posta elettronica.  Protocolli per la ricezione:   POP3 (Post Office Protocol versione 3) : Protocollo che consente ai client di posta elettronica di recuperare email dal server. Le email vengono scaricate localmente sul dispositivo e possono essere rimosse dal server dopo il download.   IMAP (Internet Message Access Protocol) :\nProtocollo più avanzato rispetto a POP3. IMAP permette di visualizzare e organizzare le email direttamente sul server, mantenendo una sincronizzazione tra il server e il dispositivo locale. Le email non vengono necessariamente scaricate sul dispositivo.    MTA (Mail Transfer Agent)  Il MTA (Mail Transfer Agent) è un componente software responsabile del trasferimento delle email da un server all'altro sulla rete. Gli MTA gestiscono l'inoltro delle email utilizzando protocolli come SMTP (Simple Mail Transfer Protocol) per consegnarle al server di destinazione. Esempi di MTA includono Postfix, Sendmail e Microsoft Exchange.  MUA (Mail User Agent):  Il MUA (Mail User Agent) è un'applicazione software che consente agli utenti di interagire con il servizio di posta elettronica. Gli MUA sono anche chiamati client di posta elettronica e forniscono un'interfaccia utente per la composizione, la lettura e la gestione delle email. Esempi di MUA includono Outlook, Thunderbird e Gmail (tramite interfaccia web).  In breve, l'MTA si occupa del trasferimento delle email tra i server, mentre l'MUA è l'interfaccia che gli utenti utilizzano per inviare, ricevere e gestire le email sul proprio dispositivo.    SMTP (Simple Mail Transfer Protocol)  è definito dall'RFC 822, che specifica il formato del messaggio di posta elettronica. Questo formato è composto da un'intestazione e un corpo, entrambi separati da una linea vuota.    Header    To : Lista di destinatari.   From : Mittente.   CC : Lista di destinatari in copia.   Bcc : Lista nascosta di destinatari in copia.   Date : Data di spedizione.   Reply-to : Indirizzo diverso dal mittente.   Subject : Titolo del messaggio.  Body:   Messaggio vero e proprio, costituito da caratteri ASCII.  Se si desidera inviare contenuti non testuali, devono essere convertiti in ASCII prima dell'invio.  I caratteri ASCII trasportati sono a 7 bit (128).  Trasferimento SMTP:  Usa il protocollo TCP sulla porta 25.\nIl trasferimento del messaggio coinvolge tre fasi:\nIl programma del mittente invia il messaggio al proprio server (A) usando SMTP.\nIl server A trasferisce il messaggio al server del destinatario B utilizzando lo stesso protocollo.\nIl destinatario preleva il messaggio dal proprio server B utilizzando un protocollo come POP3 o IMAP.  Post Office Protocol (POP3)  Il   Post Office Protocol versione 3 (POP3)  è un protocollo utilizzato per il recupero delle email dal server di posta elettronica al dispositivo dell'utente. Ecco alcune caratteristiche chiave di POP3:    Connessione al Server:    Porta di Default:  La porta di default per POP3 è la porta 110.   Connessione Sicura:  POP3 può essere utilizzato su una connessione sicura (SSL/TLS) sulla porta 995.  Fasi del Prelievo:    Autorizzazione:   L'utente si connette al server POP3 e si autentica con un nome utente e una password.   Download delle Email:   Dopo l'autorizzazione, l'utente può scaricare le email presenti sul server.  Le email vengono spostate dal server al dispositivo dell'utente durante il processo di download.   Conservazione sul Server (Opzionale):   In alcune configurazioni, l'utente può scegliere se conservare o eliminare le email dal server dopo il download.  Questa opzione consente di scaricare le email su più dispositivi senza eliminarle dal server.   Chiusura della Connessione:   Una volta completato il download delle email, l'utente può chiudere la connessione.  Limitazioni di POP3:    Archiviazione Locale:  Le email vengono scaricate e archiviate localmente sul dispositivo dell'utente, il che significa che non sono più disponibili sul server, a meno che l'utente scelga di conservarle.   Gestione Limitata sul Server:  POP3 offre una gestione limitata delle email sul server. Le email scaricate vengono solitamente rimosse dal server, e le operazioni come la creazione di cartelle sono spesso limitate a livello locale.   Sincronizzazione Limitata:  Poiché le email sono archiviate localmente, il loro stato (letto/non letto) e altre modifiche non sono sincronizzate tra diversi dispositivi.  Il POP3 è particolarmente adatto per chi desidera gestire le proprie email principalmente su un unico dispositivo e non necessita di una sincronizzazione complessa tra più dispositivi.  IMAP (Internet Mail Access Protocol)  Il   Internet Message Access Protocol (IMAP)  è un protocollo utilizzato per il recupero delle email dal server di posta elettronica al dispositivo dell'utente. A differenza di POP3, IMAP offre una gestione più avanzata delle email sul server. Di seguito sono descritte le caratteristiche principali di IMAP:    Connessione al Server:    Porta di Default:  La porta di default per IMAP è la porta 143.   Connessione Sicura:  IMAP può essere utilizzato su una connessione sicura (SSL/TLS) sulla porta 993.  Fasi del Prelievo:    Autorizzazione:   L'utente si connette al server IMAP e si autentica con un nome utente e una password.   Visualizzazione della Struttura delle Caselle di Posta:   IMAP permette agli utenti di visualizzare la struttura delle caselle di posta sul server. Le email non vengono scaricate automaticamente durante la connessione.   Download Selettivo:   L'utente può scegliere quali email scaricare sul dispositivo e quali lasciare sul server.   Gestione Avanzata sul Server:   IMAP consente di organizzare le email sul server, creare cartelle, segnare le email come lette/non lette e altro.  Le modifiche effettuate su un dispositivo sono sincronizzate con il server e riflettono lo stato delle email su tutti i dispositivi connessi.   Sincronizzazione Avanzata:   IMAP offre una sincronizzazione avanzata dello stato delle email tra dispositivi.  Vantaggi di IMAP:    Archiviazione sul Server:  Le email rimangono archiviate sul server anche dopo essere state visualizzate, consentendo un accesso uniforme da più dispositivi.   Gestione Completa delle Email:  IMAP permette una gestione completa delle email direttamente sul server, garantendo coerenza tra i dispositivi.   Sincronizzazione Avanzata:  Le modifiche apportate su un dispositivo (letto/non letto, cancellato, spostato) sono riflesse su tutti i dispositivi connessi.  IMAP è ideale per chi desidera un accesso flessibile alle email da diversi dispositivi, con una gestione avanzata delle email direttamente sul server.",{"id":84,"path":85,"dir":86,"title":87,"description":88,"keywords":89,"body":93},"content:3.email-dns-telnet:2.dns.md","/email-dns-telnet/dns","email-dns-telnet","DNS","Il DNS (Domain Name System) è un sistema di nomenclatura gerarchico utilizzato per tradurre gli indirizzi IP numerici in nomi di dominio leggibili dagli esseri umani e viceversa. In altre parole, il DNS funge da \"rubrica telefonica\" di Internet, consentendo agli utenti di utilizzare nomi di dominio (come www.example.com) anziché dover memorizzare gli indirizzi IP numerici associati.",[90,91,92],"A cosa serve il DNS:","TLD (Top Level Domain)","Root Server","  DNS  Il DNS (Domain Name System) è un sistema di nomenclatura gerarchico utilizzato per tradurre gli indirizzi IP numerici in nomi di dominio leggibili dagli esseri umani e viceversa. In altre parole, il DNS funge da \"rubrica telefonica\" di Internet, consentendo agli utenti di utilizzare nomi di dominio (come   www.example.com ) anziché dover memorizzare gli indirizzi IP numerici associati.    A cosa serve il DNS:    Traduzione Nomi di Dominio in Indirizzi IP :  Il DNS consente agli utenti di utilizzare nomi di dominio al posto degli indirizzi IP numerici. Ad esempio, traduce   www.example.com  nell'indirizzo IP corrispondente.    Facilita la Navigazione su Internet :  Semplifica la navigazione su Internet, consentendo agli utenti di memorizzare e utilizzare facilmente nomi di dominio piuttosto che dover ricordare lunghe sequenze di numeri.    Gestione dei Record DNS :  Il DNS contiene record che forniscono informazioni specifiche su un dominio, come gli indirizzi IP dei server dei siti web, i record di posta (MX) per la gestione delle email, record di servizio (SRV) per specifiche applicazioni e altro.    Bilanciamento del Carico :  Permette la distribuzione del traffico su più server attraverso il bilanciamento del carico DNS, migliorando le prestazioni e la resilienza dei servizi online.    Altre Funzionalità Avanzate :  Il DNS supporta funzionalità avanzate come la risoluzione inversa (traduzione di indirizzi IP in nomi di dominio), la gestione dei sottodomini e la cache dei record, riducendo il carico sui server DNS.  TLD (Top Level Domain)  Il   Top-Level Domain (TLD) , in italiano \"Dominio di Primo Livello\", è la parte finale di un nome di dominio di Internet. È la parte dell'indirizzo di un sito web che segue l'ultimo punto e viene posizionata alla più alta gerarchia nella struttura dei domini. I TLD sono spesso formati da una o più lettere e sono utilizzati per identificare la categoria o la nazionalità del dominio.    Ci sono due tipi principali di TLD:    TLD Generici (gTLD):   Questi sono TLD generali e non sono associati a una specifica nazione o territorio.  Esempi comuni includono .com, .org, .net, .edu, .gov, .info, .biz e molti altri.   TLD di Codice di Paese (ccTLD):   Questi sono TLD specifici per ciascun paese o territorio.  Esempi includono .us per gli Stati Uniti, .uk per il Regno Unito, .ca per il Canada e così via.  Alcuni esempi di nomi di dominio completi con i rispettivi TLD sono:    www.example.com  (gTLD: .com)   www.example.org  (gTLD: .org)   www.example.net  (gTLD: .net)   www.example.us  (ccTLD: .us)   www.example.uk  (ccTLD: .uk)  I TLD sono amministrati e gestiti da enti specifici, come l'Internet Corporation for Assigned Names and Numbers (ICANN) per i gTLD e vari enti nazionali per i ccTLD. L'assegnazione e la gestione dei TLD sono regolate da norme e politiche stabilite da queste organizzazioni.  Root Server  Distribuiti globalmente, i Root Server delegano le richieste alle autorità dei TLD, contribuendo alla stabilità e all'affidabilità del sistema DNS. Il numero limitato di Root Server è gestito da diverse organizzazioni, e la loro distribuzione geografica, inclusi duplicati o \"mirror\", riduce la latenza e aumenta la resilienza.  Attualmente, ci sono 13 server radice principali nel mondo. Questi server sono distribuiti in varie regioni geografiche e sono gestiti da diverse organizzazioni. I server radice sono identificati dalle lettere da \"A\" a \"M\", e ogni lettera rappresenta un server radice distintivo.       Lettera  Indirizzo IP  Indirizzo IPv6  Hostname  Organizzazione  Posizione    A  198.41.0.4  2001:503:ba3e::2:30  ns.internic.net  Verisign  Stati Uniti   B  199.9.14.201  2001:500:200::b  ns1.isi.edu  USC-ISI  Stati Uniti   C  192.33.4.12  2001:500:2::c  c.psi.net  Cogent Communications  Stati Uniti   D  199.7.91.13  2001:500:2d::d  terp.umd.edu  University of Maryland  Stati Uniti   E  192.203.230.10  2001:500:a8::e  ns.nasa.gov  NASA Ames Research Center  Stati Uniti   F  192.5.5.241  2001:500:2f::f  ns.isc.org  Internet Systems Consortium  Stati Uniti   G  192.112.36.4  2001:500:12::d0d  ns.nic.ddn.mil  Defense Information Systems Agency  Stati Uniti   H  198.97.190.53  2001:500:1::53  aos.arl.army.mil  U.S. Army Research Lab  Stati Uniti   I  192.36.148.17  2001:7fe::53  nic.nordu.net  Netnod  Svezia   J  192.58.128.30  2001:503:c27::2:30  -  Verisign  Stati Uniti   K  193.0.14.129  2001:7fd::1  -  RIPE NCC  Paesi Bassi   L  199.7.83.42  2001:500:9f::42  -  ICANN  Stati Uniti   M  202.12.27.33  2001:dc3::35  -  WIDE Project  Giappone  Questa distribuzione geografica contribuisce alla riduzione della latenza e alla maggiore resilienza del sistema DNS, garantendo che gli utenti di tutto il mondo possano accedere in modo efficiente ai servizi online attraverso la risoluzione dei nomi di dominio.",{"id":95,"path":96,"dir":86,"title":97,"description":98,"keywords":99,"body":100},"content:3.email-dns-telnet:3.telnet.md","/email-dns-telnet/telnet","Telnet","Telnet è un protocollo di rete utilizzato per stabilire una connessione remota tra due dispositivi su una rete IP. Il protocollo Telnet consente agli utenti di accedere e controllare un dispositivo remoto come se fossero fisicamente connessi a esso. Tuttavia, va notato che Telnet trasmette dati, comprese le credenziali di accesso, in formato di testo non crittografato, rendendolo vulnerabile a intercettazioni malevole.",[],"  Telnet  Telnet è un protocollo di rete utilizzato per stabilire una connessione remota tra due dispositivi su una rete IP. Il protocollo Telnet consente agli utenti di accedere e controllare un dispositivo remoto come se fossero fisicamente connessi a esso. Tuttavia, va notato che Telnet trasmette dati, comprese le credenziali di accesso, in formato di testo non crittografato, rendendolo vulnerabile a intercettazioni malevole.     telnet   indirizzo_ip   porta\n  Dove \"indirizzo_ip\" è l'indirizzo IP del dispositivo remoto e \"porta\" è la porta su cui Telnet è in ascolto. Telnet può essere utilizzato per accedere a dispositivi come router, switch o server remoti che supportano il protocollo Telnet. Tuttavia, a causa delle preoccupazioni per la sicurezza, Telnet è spesso sostituito da protocolli più sicuri come SSH (Secure Shell) quando è necessario un accesso remoto.  html .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}html.dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}html .dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}html .default .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}",1700810461961]